import { TopicPracticeBox } from "@/components/pages/docs/boxes/TopicPracticeBox";
import { BlockMath, InlineMath } from "react-katex";

import { HintBox } from "@/components/pages/docs/boxes/HintBox";
import { SummaryBox } from "@/components/pages/docs/boxes/SummaryBox";
import { AlertTriangleIcon, BookAIcon, ChartBarIcon, LightbulbIcon, WrenchIcon } from "lucide-react";
import { PracticeExercise, SummarySection } from "@/types/docs/topic";
import { div } from "three/tsl";
import { p, ul } from "framer-motion/client";


const FossilQA = () => {

  const practiceExercises: PracticeExercise[] = [
    {
      id: "ex1",
      title: "",
      description: "សំណួរទី ១",
      problemType: "First Exercise",
      problems: [
        <p key="p1">តើផូស៊ីលជាអ្វី? ការកកើតផូស៊ីលមានប៉ុន្មានរបៀប? អ្វីខ្លះ?</p>
      ],
      answers: [
        <ul className="list-disc pl-5 flex flex-col gap-3 items-start" key="ul1">
          <li>ផូស៊ីលគឺជាស្នាម ឬសំណល់ភាវៈរស់ដែលបានបន្សល់ទុកនៅសម័យយូរលង់មកហើយ។</li>
          <li>ដំណើរកកើតផូស៊ីលមាន៣របៀប៖</li>
          <p key="p2">_ ដំណើរក្លាយជាថ្ម សំណល់ភាវៈរស់ខ្លះដែលកប់ជាប់ក្នុងកំទេចកំណប្លែងជាថ្ម</p>
          <p key="p3">_ ពុម្ពក្រៅនិងពុម្ពក្នុង</p>
          <li>ពុម្ពក្រៅពេលដែលសារពាង្គកាយកប់ក្នុងកំទេចកំណត្រូវ ក្លាយបន្តិចម្តងៗហើយបន្សល់ទុកពុម្ពទទេ។</li>
          <li>ពុម្ពក្នុងទឹកហូរនាំកំទេចកំណមកចាក់បំពេញពុម្ពនោះ បង្កើតបានជាពុម្ពក្នុងដែលប្លែងជាសិលាមានទ្រង់ទ្រាយដូចសារពាង្គកាយ។</li>
          <p key="p4">_ ការបន្សល់ទុកសារពាង្គកាយនៅទាំងមូលកប់ក្នុងជ័ររុក្ខជាតិ ឬទឹកកក។</p>
        </ul>
      ]
    },
    {
      id: "ex2",
      title: "",
      description: "សំណួរទី ២",
      problemType: "Second Exercise",
      problems: [
        <p key="p1">តើភាវៈរស់អាចបន្សល់អ្វីខ្លះទុកជាផូស៊ីល?</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="div1">
          <p key="p2">ភាវៈរស់អាចបន្សល់ទុកឆ្អឹង គម្រសារពាង្គកាយ (សំបកសិប្បីសត្វ) ឬរាងកាយទាំងមូលក្នុងករណីកប់ជាប់ក្នុងទឹកកក។</p>
        </div>
      ]
    },
    {
      id: "ex3",
      title: "",
      description: "សំណួរទី ៣",
      problemType: "Third Exercise",
      problems: [
        <p key="p1">តើផូស៊ីលមានសារះសំខាន់ដូចម្តេចខ្លះ?</p>
      ],
      answers: [
        <ul className="list-disc pl-5 flex flex-col gap-3 items-start" key="ul1">
          <li>ធ្វើឲ្យយើងស្គាល់ប្រវត្តិនៃការវិវត្តរបស់ភាវៈរស់គឺ ការកកើត ការរីកចម្រើន និងការវិនាសបាត់ទៅវិញនៃប្រភេទនៃភាវៈរស់នីមួយៗ។</li>
          <li>ធ្វើឲ្យយើងស្គាល់ប្រវត្តិនៃផែនដីដែលបង្ហាញនូវលក្ខណះអាកាសធាតុនាសម័យកាលនីមួយៗ។</li>
        </ul>
      ]
    },
    {
      id: "ex4",
      title: "",
      description: "សំណួរទី ៤",
      problemType: "Fourth Exercise",
      problems: [
        <p key="p1">ចូរពន្យល់ពី ការកកើតនៃពុម្ពក្រៅ ។</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="div1">
          <p key="p2">ការកកើតពុម្ពក្រៅ កកើតឡើងនៅពេលសារពាង្គកាយកប់ក្នុងកំទេចកំណត្រូវរលាយបន្តិចម្តងៗហើយបន្សល់ទុក
            នូវពុម្ពទទេដែលមានទម្រង់ដូចសារពាង្គកាយ។ ពុម្ពទទេនេះ ជាពុម្ពក្រៅ។ (ឬនៅពេលភាវៈរស់បានងាប់ទៅបានធ្លាក់ទៅ
            បាតបឹងឬបាតសមុទ្រ ទឹកហូរនាំសិលាកម្ទេចកំណគ្របដណ្តប់លើសាកសពនោះ។ សាកសពរលួយបែកធាតុហើយបន្សល់
            ទុកនៅតែរូបរាង ដែលបង្ហាញពីរូបរាងរបស់ភាវៈរស់នោះ នេះជាពុម្ពក្រៅ)។</p>
        </div>
      ]
    },
    {
      id: "ex5",
      title: "",
      description: "សំណួរទី ៥",
      problemType: "Fifth Exercise",
      problems: [
        <p key="p1">តើគេប្រេីវិធីអ្វីខ្លះដេីម្បីកំណត់អាយុះផូស៊ីល?</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="div1">
          <p key="p2">ដេីម្បីកំណត់អាយុះផូស៊ីលមាន2វិធី:</p>
          <ul className="list-disc flex flex-col gap-3 pl-5" key="ul1">
            <li>តាមស្រទាប់សិលា</li>
            <li>តាមសារធាតុវិទ្យុសកម្ម</li>
          </ul>
        </div>
      ]
    },
    {
      id: "ex6",
      title: "",
      description: "សំណួរទី ៦",
      problemType: "Sixth Exercise",
      problems: [
        <p key="p1">ចូរពន្យល់វិធីកំណត់អាយុផូស៊ីលតាមសារធាតុវិទ្យុកម្ម ។</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="div1">
          <p key="p2">សារធាតុវិទ្យុសកម្ម អាចបំបែកហើយប្លែងជាសារធាតុមួយផ្សេងទៀត ហើយល្បឿននៃការបំបែកនេះថេរ
            មិនទាក់ទងនឹងលក្ខខណ្ឌនៃមជ្ឈដ្ឋានក្រៅទេ ។ ក្នុងការកំណត់អាយុសិលាឬផូស៊ីល គេអាចគណនារយៈពេលនៃការបំបែកសារធាតុវិទ្យុសកម្មដែលមានក្នុងផូស៊ីលឬសិលានោះ ។
            ដើម្បីកំណត់អាយុសិលាឬផូស៊ីលថ្មីៗ គេសំអាងទៅលើការបំបែកកាបូនវិទ្យុសកម្ម c14 ។ នៅក្នុងបរិយាកាសមានកាបូនវិទ្យុសកម្ម c14
            និង កាបូនធម្មតា c12 ហើយផលធៀប c14/c12ថេរ ។ កាបូននៅក្នុងសារពាង្គកាយមានប្រភពពីកាបូននៅក្នុងបរិយាកាស ។
            ក្នុងជីវិតរស់នៅសត្វ ឬរុក្ខជាតិនីមួយៗស្រូបយកកាបូនធម្មតាផង កាបូនវិទ្យុសកម្មផង ។ផលធៀប c14c12ក្នុងសារពាង្គកាយស្មើនឹងផលធៀប
            c14c12 ក្នុងបរិយាកាស ។ តែរសារពាង្គកាយមួយស្លាប់ កាបូន c14 នៅក្នុងសារពាង្គកាយនៅតែបំបែកជាបន្តទៀត ប៉ុន្តែវាមិនស្របយកកាបូន c14 ថ្មីទៀតទេ ។រយៈពេលនៃការបំបែកបរិមាណកាបូន c14បានចំនួនពាក់កណ្តាលរបស់កាបូន c14គឺ 5730 ។
            ដើម្បីគណនាអាយុផូស៊ីលមួយ អ្នកវិទ្យាសាស្រ្តប្រៀបធៀបផលររៀបc14c12។ នៅក្នុងផូស៊ីល និងនៅក្នុងបរិយាកាស។ បើផលធៀបរនៅក្នុងផូស៊ីលស្មើនឹងពាក់កណ្តាលនៃផលររៀបក្នុងបរិយាកាស ផូស៊ីលមានអាយុ 5730 ឆ្នាំ ។
            អ្នកវិទ្យាសាស្រ្តប្រើវិទ្យុសកម្មកាបូន c14 ដើម្បីកំណត់អាយុផូស៊ីលតិចជាង 7000ឆ្នាំ ។ ចំពោះផូស៊ីលអាយុច្រើនជាងនេះ កាបូន c14នៅក្នុងផូស៊ីលតិចពេក ធ្វើឲ្យពិបាកក្នុងការគណនា។ ដូចនេះ គេប្រើសារធាតុអុយរ៉ាហ្សូម ឫ រ៉ាដ្យូមចំពោះផូស៊ីលអាយុរាប់លានឆ្នាំ ពីព្រោះរយៈពេលនៃការបំបែកពាក់កណ្តាលរបស់សារធាតុរនេះវែង ។</p>
        </div>
      ]
    },
    {
      id: "ex7",
      title: "",
      description: "សំណួរទី ៧",
      problemType: "Seventh Exercise",
      problems: [
        <p key={"q1"}>ប្រៀបធៀបការកំណត់អាយុផូសុីលតាមសារធាតុវិទ្យុកម្មនិងតាមស្រទាប់សិលា ។</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="a1">
          <p>ការកំណត់តាមស្រទាប់សិលា អាចធ្វើការប្រៀបធៀបអាយុផូស៊ីលដែលមានក្នុងស្រទាប់ផ្សេងៗ នៃសិលាកម្ទេចកំណ ។ ចំណែកឯការកំណត់តាមវិទ្យុសកម្ម អាចឲ្យដឹងពីអាយុនៃផូស៊ីលមួយដោយផ្អែកលើបរិមាណនៃសារធាតុវិទ្យុសកម្មដែលមានក្នុងផូស៊ីលនោះ។</p>
        </div>
      ]
    },
  ];
  return (
    <div>
      <>
        <TopicPracticeBox exercises={practiceExercises} />
      </>
    </div>
  )
}

export default FossilQA
