import { TopicPracticeBox } from "@/components/pages/docs/boxes/TopicPracticeBox";

import { PracticeExercise } from "@/types/docs/topic";


const BioTechQA = () => {

  const practiceExercises: PracticeExercise[] = [
    {
      id: "ex1",
      title: "",
      description: "សំណួរទី ១",
      problemType: "First Exercise",
      problems: [
        <p key="q1">តើវិស្វកម្មសេនេទិចជួយដល់រុក្ខជាតិដូចម្តេចខ្លះ?</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="a1">
          <p>វិស្វកម្មសេនេទិចជួយដល់រុក្ខជាតិគឺ ធ្វើឲ្យរុក្ខជាតិធន់នឹងជំងឺ សត្វល្អិតចង្រៃ អាកាសធាតុ ថ្នាំសម្លាប់សត្វល្អិត ថ្នាំសម្លាប់ស្មៅ ធ្វើឲ្យរុក្ខជាតិមានផ្លែផ្កាច្រើន និងជួយបង្កើនគុណភាពដំណាំ។</p>
        </div>
      ]
    },
    {
      id: "ex2",
      title: "",
      description: "សំណួរទី ២",
      problemType: "Second Exercise",
      problems: [
        <p key="q1">តើវ៉ាក់សាំងជាអ្វី?</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="a1">
          <p>វ៉ាក់សាំង ជាសារធាតុដែលរៀបចំឡើងសម្រាប់បង្កើតឲ្យមានភាពស៊ាំនៅក្នុងសារពាង្គកាយមនុស្ស សត្វ ហើយធ្វើឲ្យសារពាង្គកាយទាំងនោះប្រឆាំងនិងការរាតត្បាតនៃមេរោគ។</p>
        </div>
      ]
    },
    {
      id: "ex3",
      title: "",
      description: "សំណួរទី ៣",
      problemType: "Third Exercise",
      problems: [
        <p key="q1">ក. ដូចម្តេចដែលហៅថាអាំងទែផេរ៉ូន? អាំងទែឡីគីន?</p>,
        <p key="q2">ខ. តើគេប្រើវាសម្រាប់ព្យាបានលជំងឺអ្វី?</p>,
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="a1">
          <p>_ អាំងទែផេរ៉ូន ជាប្រភេទប្រូតេអ៊ីនដែលផលិតចេញពីកោសិកាបង្ករោគ។ វាមាននាទីទប់ស្កាត់កុំឲ្យវីរុសទៅរាតត្បាត និងបន្តពូជក្នុងកោសិកាផ្សេងៗដែលនៅក្បែរវា។</p>
          <p>_ អាំងទែឡីគីន ជាប្រភេទប្រូតេអ៊ីនដែលបញ្ចេញពីកោសិកាផ្សេងៗនៃប្រព័ន្ធភាពស៊ាំ។ វាមានឥទ្ធិពលទៅលើកោសិកាផ្សេងៗនៃប្រព័ន្ធភាពស៊ាំ ដោយភ្លេចការធ្វើចំណែក និងបំលែងឯកទេសរបស់ឡាំផូស៊ីត។</p>
        </div>,
        <div className="flex flex-col gap-3 text-[15px]" key="a2">
          <p>គេប្រើវាសម្រាប់ព្យាបាលជំងឺមហារីក។</p>
        </div>
      ]
    },
    {
      id: "ex4",
      title: "",
      description: "សំណួរទី ៤",
      problemType: "Fourth Exercise",
      problems: [
        <p key="q1">តើអង់ទីប្យូទិចជាអ្វី?</p>
      ],
      answers: [
        <div className="flex flex-col gap-3 text-[15px]" key="a1">
          <p>អង់ទីប្យូទិច ជាសារធាតុដែលផលិតដោយមីក្រូសារពាង្គកាយ សម្រាប់ព្យាបាលជំងឺបង្កដោយបាក់តេរី។</p>
        </div>
      ]
    },
    {
      id: "ex5",
      title: "",
      description: "សំណួរទី ៥",
      problemType: "Fifth Exercise",
      problems: [
        <p key="q1">តើវិស្វកម្មសេនេទិចផ្តល់ផលល្អ និង ផលអាក្រក់អ្វីខ្លះដល់មនុស្ស??</p>
      ],
      answers: [
        <ul className="list-disc pl-5 gap-2 flex flex-col items-start text-[14px]" key="a1">
          <li>ផលល្អដល់មនុស្ស៖</li>
          <p>_ ក្នុងវិស័យសុខាភិបាល ផលិតអាំងស៊ុយលីន អាំងទែផែរ៉ូន អាំងទែឡីគីន អង់ទីហ្សូទិច អង់ទីករ វ៉ាក់សាំង។ល។</p>
          <p>_ ក្នុងវិស័យកសិកម្ម ធ្វើឲ្យរុក្ខជាតិមានផ្លែផ្កាច្រើន ធន់នឹងជំងឺ ធន់នឹងអាកាសធាតុ ធន់នឹងថ្នាំសម្លាប់សត្វល្អិត ថ្នាំសម្លាប់ស្មៅ និងជួយបង្កើនគុណភាពដំណាំ។</p>
          <p>_ ក្នុងវិស័យឧស្សាហកម្ម: ស្បៀង ផលិតអាហារ មានអរម៉ូន ទឹកដោះគោជូរ ប្រូម៉ាស ស្រាបៀរ នំប៉័ង។</p>
          <li>ផលអាក្រក់ដល់មនុស្ស៖</li>
          <p>_ គ្រោះថ្នាក់ប៉ះពាល់ដល់បរិស្ថានៈ រុក្ខជាតិ (GM) ធ្វើឲ្យបាត់បង់ជីវិត ជីវៈចម្រុះ សត្វល្អិតធន់នឹងរុក្ខជាតិ (GM) មាន
            សកម្មភាពពុលដូចជារុក្ខជាតិ (GM) ធ្វើឲ្យរុក្ខជាតិឈ្មោលអារមិនអាចផលិតគ្រាប់លម្អងសម្រាប់បន្តពូជ។</p>
          <p>_ គ្រោះថ្នាក់ដល់សុខភាព: ផលិតសារធាតុគីមីប្រើប្រាស់ក្នុងសង្គ្រាមអង់ទីហ្សូទិច មិនអាចព្យាបាលជំងឺដែលបណ្តាលមកពីមានសែនដែលធន់នឹងអង់ទីហ្សូទិច។</p>
          <p>_ គ្រោះថ្នាក់ប៉ះពាល់ដល់សីលធម៌និងសង្គម: ធ្វើឲ្យសែនមុយតាស្យុងដែលមានឥទ្ធិពលអាក្រក់ដល់សណ្ដានក្រោយ ប៉ះពាល់សាសនា បែងចែកវណ្ណៈ (មានតែអ្នកមានទើបធ្វើវិស្វកម្មសេនេទិចបាន)។</p>
          <p>_ គ្រោះថ្នាក់ប៉ះពាល់ដល់សេដ្ឋកិច្ច: ក្រុមហ៊ុនផលិតគ្រាប់រុក្ខជាតិ (GM) ការពារស្របច្បាប់មិនឲ្យក្រុមហ៊ុនដទៃផលិត
            គ្រាប់រុក្ខជាតិ (GM) នោះទេ។ គ្រាប់រុក្ខជាតិមិនអាចបន្តពូជបានទេ គឺត្រូវទិញពូជពីក្រុមហ៊ុនជារៀងរាល់ឆ្នាំ។</p>
        </ul>
      ]
    },
    {
      id: "ex6",
      title: "",
      description: "សំណួរទី ៦",
      problemType: "Sixth Exercise",
      problems: [
        <p key={"q1"}>ចូរពន្យល់ពាក្យអ៊ីប្រ៊ីតកម្ម អេតេរ៉ូស៊ីស ក្លូន ប៉ូលីប្លូអ៊ីឌី វិស្វកម្មសេនេទិច អង់ស៊ីមបង្រួម អង់ស៊ីមភ្ជាប់។</p>
      ],
      answers: [
        <ul className="list-disc pl-5 flex flex-col items-start text-[14px] gap-3" key="a1">
          <li>អីប្រ៊ីតកម្ម ជាការបង្កាត់រវាងមេបាប្រភេទខុសគ្នា ឬមានពូជខុសគ្នា ឬមានលក្ខណះខុសគ្នាផ្នែកសេនេទិច ដើម្បីឲ្យកូននៅជាអីប្រ៊ីត។</li>
          <li>អេតេរ៉ូស៊ីស គឺជាបាតុភូតដែលផ្តល់ឲ្យក្នុងការបង្កាត់រវាងមេបាមានពូជខុសគ្នា ឬប្រភេទខុសគ្នា ឬមានសែស្រឡាយ
            ឆ្ងាយដាច់ពីគ្នា នូវសន្តានក្រោយជាអ៊ីប៊ីត ដែលមានកម្លាំងជីវិតខ្លាំង ផ្តល់ទិន្នផលខ្ពស់ បង្កើនចំនួនអាឡែលអេតរ៉ូស៊ីកូត គឺកំណើនសមត្ថភាព។</li>
          <li>ក្លូន គឺជាកោសិកាលូតលាស់មួយក្រុម ឬសារពាង្គកាយមួយក្រុមដែលកើតចេញពីកោសិកាមេតែមួយ ហើយមានព័ត៌មានសេនេទិចដូចគ្នា។</li>
          <li>ប៉ូលីប្លូអីឌី គឺជាបាតុភូតដែលធ្វើឲ្យចំនួនក្រូម៉ូសូមកើនឡើងតាមពហុគុណនៃnគឺ3n, 4n, 5n...។</li>
          <li>វិស្វកម្មសេនេទិច គឺជាសំណុំបច្ចេកទេសមួយដែលធ្វើឲ្យមានបន្ទេរសែនចម្លែកមួយ ទៅក្នុងកោសិកាបណ្តុះមួយដើម្បីឲ្យកោសិកាផ្នួលទទួលបាននូវលក្ខណះថ្មីជាប់នឹងសែនបន្ទេរនោះ។</li>
          <li>អង់ស៊ីមបង្រួម គឺជាអង់ស៊ីមសម្រាប់កាត់ម៉ូលេគុលADNជាអង្កត់តូចៗនៅត្រង់តំណលំដាប់បាស។</li>
          <li>អង់ស៊ីមភ្ជាប់ ជាអង់ស៊ីមសម្រាប់ភ្ជាប់នុយក្លេអូទីតរវាងគ្នា ដើម្បីបង្កើតបានជាADN ។</li>

        </ul>
      ]
    },
  ];
  return (
    <div>
      <>
        <TopicPracticeBox exercises={practiceExercises} />
      </>
    </div>
  )
}

export default BioTechQA
