import React from "react";
import "katex/dist/katex.min.css";
import { TopicContent_V3 } from "@/types/docs/topic";
import ContentRendererV3 from "@/components/pages/docs/utils/ContentRendererV2";
import {
  ImageExplanationBox,
  ImageBoxProps,
} from "@/components/pages/docs/boxes/explanation-box/ImageExplanationBox";

const content: TopicContent_V3[] = [
  {
    type: "tip",
    title: "រូបផ្ដុំត្រចៀក",
    content: (
      <div className="ml-4">
        ត្រចៀកចែកចេញជា បីផ្នែក​ ៖<br />
        • ត្រចៀកក្រៅ <br />
        • ត្រចៀក​កណ្ដាល <br />
        • ត្រចៀកក្នុង
      </div>
    ),
  },
  {
    type: "tip",
    title: "​ត្រចៀកក្រៅ",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/AuditorySensory/OuterEar.png"
        imageAlt=""
        explanation={[
          <div key="outer-ear-explanation">
            • ត្រចៀកក្រៅ រួមមានស្លឹកត្រចៀក និងបំពង់សោតវិញ្ញាណ។ <br />
            • ស្លឹកត្រចៀក ​គឺប្រមូលផ្ដុំរលកសូរឯបំពង់សោតវិញ្ញាណដឹកនាំរលកសូរទៅកាន់ក្រដាសត្រចៀក​។ <br />
            • ត្រចៀកក្រៅ មាននាទីប្រមូលផ្ដុំរលក​ និងបញ្ជូនរលកសូរ​ ទៅកាន់ត្រចៀកកណ្ដាលដោយឆ្លងកាត់ក្រដាសត្រចៀក​។ <br />
          </div>,
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "​ត្រចៀកកណ្ដាល",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/AuditorySensory/MiddleEar.png"
        imageAlt=""
        explanation={[
          <div key="middle-ear-explanation">
            • ត្រចៀក​កណ្ដាល ជាប្រហោងមួយពេញដោយខ្យល់ ចាប់ពីក្រដាសត្រចៀកមានឆ្អឹងតូចៗបីបន្តជាប់គ្នា បង្កើតជាស្ពានឆ្លងកាត់ត្រចៀកកណ្ដាល
            ដែលភ្ជាប់ក្រដាសត្រចៀកទៅនឹងបង្អួចរាងពងក្រពើ។ វាមាននាទីបំពងសម្លេងអោយកាន់តែខ្លាំង។<br />
            • ត្រចៀក​កណ្ដាល ភ្ជាប់ទៅនឹងបំពង់កដោយប្រមោយ​ <b>អឺស្តាស</b>។ <br />
            • ប្រមោយអឺស្តាស មាននាទីសម្រួលសម្ពាធខ្យល់នៅក្នុងត្រចៀកកណ្ដាលឲ្យស្មើនឹងសម្ពាធខ្យល់នៅក្រៅសារពាង្គកាយ ដើម្បីបង្ការការរហែកក្រដាសត្រចៀក។​​ <br />
            •​ ត្រចៀក​កណ្ដាល វាមាននាទីចាប់យកសូរសំឡេង បញ្ចូននិងបំពងសំឡេងឲកាន់តែខ្លាំង<br />
          </div>,
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "ត្រចៀកក្នុង",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/AuditorySensory/InnerEar.png"
        imageAlt=""
        explanation={[
          <div key="inner-ear-explanation">
            • មានបំពង់រាងគូទខ្យង និងបំពង់ពាក់កណ្តាលរង្វង់។ <br />
            •​ បំពង់រាងគូទខ្យង ជាសរីរាង្គល្បឺ ​ពេញដោយសារធាតុរាវ​ហើយមានស្រទាប់កោសិកា
            ធ្មួលដែលមានរោមល្អិតៗ នៅលើភ្នាសខាងក្នុងនៃបំពង់។ កោសិកាធ្មួលរួសនឹងរំញ័រ។ <br />
            •​ បំពង់ពាក់កណ្តាលរង្វង់ ​ពេញដោយសារធាតុរាវ ​និងពាសដោយកោសិកាធ្មួល មាន
            ពន្លយឆ្មារៗ។​  <br />
            •​​​ បំពង់រាងគូទខ្យងជាសរីរាង្គល្បឺ ឯបំពង់ពាក់កណ្តាលរង្វង់ មាននាទីទទួលសូរសំឡេង និងជួយអោយ​សារពាង្គកាយរក្សាលំនឹង។ <br />
          </div>,
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "ល្បឺ",
    content: (
      <div key="ear-explanation">
        ពេលរលកសូរធ្វើដំណើរទៅកាន់ត្រចៀកក្នុង ក្រោយមកកោសិកាធ្មួលប្ដូរលំញ័រអោយទៅជាអាំងភ្លុចប្រសាទហើយ
        ដឹកនាំតាមសរសៃប្រសាទសោតវិញ្ញាណទៅកាន់ខួរក្បាលត្រង់កំពកសៀតផ្កា។  ខួរក្បាលបកស្រាយអាំងភ្លុច​ប្រសាទ
        នេះឲទៅជាសំឡេងដែលយើងស្តាប់បាន។
      </div>
    ),
  },
  {
    type: "tip",
    title: "តំហែរក្សាលំនឹង",
    content: (
      <div key="ear-explanation">
        • តំហែរក្សាលំនឹង ជានាទីរបស់បំពង់ពាក់កណ្តាលរង្វង់ក្នុង​ត្រចៀកក្នុង និងខួរតូច។
        នៅក្នុងត្រចៀកមានបំពង់ពាក់កណ្ដាលរង្វង់ចំនួនបីដែលពេញដោយសារធាតុរាវ
        និងមានស្រទាប់កោសិការោមញ័រ។​<br />
        • នៅពេលយើងគ្រវីក្បាល ឬបង្វិលខ្លួន សារធាតុរាវនិងរោមញ័រធ្វើចលនា។ ចលនាមេកានិច
        នៃរោមញ័រភ្ញោចចុងភីបប្រសាទឲបង្កើតអាំងភ្លុចប្រសាទ។ បន្ទាប់មកអាំងភ្លុចប្រសាទនេះធ្វើ
        ដំណើរតាមសរសៃប្រសាទសោតវិញ្ញាណទៅកាន់ខួរតូច។ ខួរតូចបកស្រាយទិសដៅរបស់ចលនា
        ហើយបញ្ចូនអាំងភ្លុចប្រសាទទៅកាន់សំបកខួរធំ។ នៅទីនោះអាំងភ្លុចប្រសាទដែលចេញពីណឺរ៉ូន
        ចលករភ្ញោចសាច់ដុំផ្នែកក្បាលនិងកឲរក្សាទីតាំងរបស់ក្បាល។
      </div>
    ),
  },
];
export default function AuditorySensory() {
  return <ContentRendererV3 content={content} />;
}
