import React from "react";
import "katex/dist/katex.min.css";
import { TopicContent_V3 } from "@/types/docs/topic";
import ContentRendererV3 from "@/components/pages/docs/utils/ContentRendererV2";
import {
  ImageExplanationBox,
  ImageBoxProps,
} from "@/components/pages/docs/boxes/explanation-box/ImageExplanationBox";


const content : TopicContent_V3[] = [
  {
    type: "tip",
    title: "",
    content: (
      <div>
        <p>
          កាយវិញ្ញាណ ជាធ្មួលវិញ្ញាណមេកានិចរួសនឹងការប៉ះទង្គិច និសីតុណ្ហភាព។ 
          ធ្មួលវិញ្ញាណមាននៅពាសពេញសារពាង្គកាយ ហើយវាទទួលរំញោចខុសៗគ្នាដូចជា 
          ក្ដៅ ត្រជាក់ ធ្ងន់ ស្រាល...។
        </p>
      </div>

    ),
  },
  {
    type: "tip",
    title: "នាទីរបស់ស្បែក",
    content: (
      <div>
        ស្បែកមាននាទីសំខាន់ៗដូចជា៖ <br />
        <div className="ml-4">
          • ការពារសារពាង្គកាយពីមេរោគ និងការរបួស។ <br />
          • រក្សាសីតុណ្ហភាពសារពាង្គកាយឲ្យមានស្ថិរភាព។ <br />
          •​​​ បង្ការការជ្រៀតចូលនៃមេរោគ <br />
          •​ ការពារសារពាង្គកាយពីឥទ្ធិពលរូប-គីមីនៃមជ្ឈដ្ឋានខាងក្រៅ <br />
          • បង្ការការបាត់បង់ជាតិទឹក <br />
          • ជាកន្លែងសម្រាប់ធ្វើបណ្ដូរស្ម័ន <br />
          • ការពារពីកម្មរស្មីស្វាយអ៊ុលត្រា <br />
          • បញ្ចេញកាកសំណល់មេតាប៉ូលីស តាមក្រពេញញើស <br />
          • ថែរក្សាផ្ទៃសារពាង្គកាយឲ្យសើមជានិច្ច <br />
          • បញ្ចេញជាតិខ្លាញ់ និងស្រូបយកសារធាតុឱសថមួយចំនួន <br />
          • ទទួលរំញោចផ្សេងៗពីបម្រែបម្រួលសីតុណ្ហភាព ការប៉ះទង្គិចជាដើម។
        </div>
      </div>
    ),
  },
  {
    type: "tip",
    title: "",
    content: (
      <ImageExplanationBox
        title="ស្បែកមានពីរស្រទាប់គឺអេពីឌែម និងឌែម"
        src="/docs/grade-12/biology/TactileSensory/TactileSensory.png"
        imageAlt=""
        explanation={[
          <div className="mt-4">
            • <b>អេពីឌែម</b> ជាស្រទាប់ក្រៅបង្អស់របស់សារពាង្គកាយដែលមានកម្រាស់ <b>0.7mm</b> ដែលកើតពីកោសិកាអេពីតេល្យូមងាប់ដែលមានផ្ទុកកេរ៉ាទីន។<br /><br />
            • <b>ឌែមរបស់ស្បែក</b> ជាស្រទាប់នៅពីក្រោមអេពីឌែមដែលមានកម្រាស់​ <b>4mm</b> វាកើតឡើងពីជាលិកាសន្ធានសរសៃយឺត និងកូឡូសែន។ 
            ស្រទាប់ឌែមសម្បូរសរសៃឈាមនិងចុងភីបប្រាសាទ។<br />
          </div>, 
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "នាទីរបស់អេពីឌែម និងឌែម",
    content: (
      <div>
        <b>+ អេពីឌែម៖ </b><br />
        <div className="ml-4">
          • ស្រទាប់នេះ ត្រូវបានជម្រុះចេញជាបន្តបន្ទាប់ហើយជំនួសវិញដោយកោសិកានៃស្រទាប់ក្នុងធ្វើចំណែកមីតូស។<br />
          • កោសិកាមេឡាណូស៊ីតនៃស្រទាប់អេពីឌែម ផលិតមេឡានីន ដែលផ្ដល់ពណ៌ឲ្យស្បែក។<br />
          • អេពីឌែមមាននាទីការពារសារពាង្គកាយពីគ្រោះថ្នាក់ផ្នែករូបគីមី និងបង្កើតរបាំងទប់ទល់នឹងគ្រោះថ្នាក់ផ្សេងៗ(មេរោគ)។<br />
        </div>
        <b>+ ឌែម៖</b> <br />
        <div className="ml-4">
          • ផ្ទុកធ្មួលវិញ្ញាណទាំង 5 ប្រភេទដែលអាចឲ្យដឹងទទួលរំញោចពីមជ្ឈដ្ឋានខាងក្រៅ<br />
          • សរសៃឈាមផ្គត់ផ្គង់សារធាតុចិញ្ចឹមដល់អេពីឌែម<br />
          • ចូលរួមតម្រូវសេតុណ្ហភាពរបស់ស្បែក<br />
          • មានសាច់ដុំរលីងចងភ្ជាប់ទៅនឹងគល់រោមដែលទាក់ទងទៅនឹងចលនារបស់រោម។<br />
        </div>
      </div>
    ),
  },
  {
    type: "tip",
    title: "សរីរាង្គបន្ទាប់បន្សំរបស់ស្បែក",
    content: (
      <div>
        សរីរាង្គបន្ទាប់បន្សំរបស់ស្បែកមានក្រពេញនៅក្នុងស្បែក រោម និងក្រចក។ <br />
        + ស្បែកក្រពេញមាន 2 បែបគឺ៖ <br />
        <div className="ml-4">
          • <b>ក្រពេញសេប៊ូម</b> មាននាទីដូចជារបាំងទប់ទល់ទៅនឹងជំងឺដែលបង្កដោយបាក់តេរី និងផ្សិត។<br />
          • <b>ក្រពេញញើស</b> មាននាទីតម្រូវសារពាង្គកាយតាមរំហួតញើស។<br />
        </div>
      </div>
    ),
  },
  {
    type: "tip",
    title: "ធ្មួលកាយវិញ្ញាណ",
    content: (
      <div>
        + ក្នុងស្រទាប់ឌែមស្បែកមានធ្មួលវិញ្ញាណ 5 ប្រភេទគឺ <br />
        <div className="ml-4">
          • ធ្មួលវិញ្ញាណឈឺចាប់<br />
          • ធ្មួលវិញ្ញាណសម្ពាធ<br />
          • ធ្មួលវិញ្ញាណបំណះទង្គិច<br />
          • ធ្មួលវិញ្ញាណកំដៅ <br />
          • ធ្មួលវិញ្ញាណត្រជាក់ <br />
        </div>
        ដែលធ្មួលវិញ្ញាណទាំងនេះសម្រាប់ឆ្លើយតបនឹងរំញោចផ្សេងៗគ្នាទៅនឹងប្រត្តិកម្មមេកានិច្ចខុសៗគ្នាដែរ។ 
        ពេលទទួលបានរំញោចធ្មួលវិញ្ញាណខ្លះរួសនឹងប៉ះទង្គិចខ្សោយ ខ្លះទៀតរួសនឹងប៉ះទង្គិចខ្លាំង ហើយធ្មួលវិញ្ញាណដទៃទៀតរួសនឹង
        ការឈឺចាប់សីតុណ្ហភាពត្រជាក់ ឬ ក្ដៅ។ <br />
        <div className="mt-4">
          + ធ្មួលកាយវិញ្ញាណមាននាទីតម្រូវសីតុណ្ហភាពរបស់សារពាង្គកាយតាមរំហួតញើស។ សារពាង្គកាយមានសីតុណ្ហភាពថេរជានិច្ច
          ដោយហេតុថាកំដៅលើសត្រូវបានបញ្ចេញដោយរំហួតទឹកតាមការបែកញើស។
        </div>
      </div>
    ),
  },

];

export default function TactileSensory() {
  return <ContentRendererV3 content={content} />;
}
