import React from "react";
import "katex/dist/katex.min.css";
import { TopicContent_V3 } from "@/types/docs/topic";
import ContentRendererV3 from "@/components/pages/docs/utils/ContentRendererV2";
import {
  ImageExplanationBox,
  ImageBoxProps,
} from "@/components/pages/docs/boxes/explanation-box/ImageExplanationBox";

const items: TopicContent_V3[] = [
  {
    type: "tip",
    title: "ទម្រង់គ្រាប់ភ្នែក",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/VisualSensory/VisualSensory1.png"
        imageAlt=""
        explanation={[
          <div>
            ភ្នែកតែឯងមិនអាចមើលឃើញរូបភាពបានទេ ព្រោះភ្នែកគ្រាន់តែជាសរីរាង្គមួយដែលចាប់យករំញោចពន្លឺ ហើយបប្លែង
            ទៅជាអាំងភ្លុចប្រាសាទបញ្ជូនទៅកាន់ខួរក្បាល។ ខួរក្បាលបកស្រាយអាំងភ្លុចប្រាសាទនេះឲ្យទៅជាគំហើញ។<br />
            <div  className="mt-4" >
            • គ្រាប់ភ្នែកមានរាងស៊្វែរមានអង្កត់ផ្ចិត<b> 2.5cm</b> ដែលស្ថិតនៅក្នុងក្រឡង់ភ្នែកនៃលលាដ៍ក្បាល។ 
            </div>
            <div className="mt-4">
            + គ្រាប់ភ្នែករបស់មនុស្សមានភ្នាសបីស្រទាប់គឺ <br />
              <div className="ml-2">
                • ក្លេរ៉ូទិច <br />
                • កូរ៉ូអុីត <br />
                • រ៉េទីន <br />
              </div>
            </div>
          </div>, 
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "ភ្នាសគ្រាប់ភ្នែក",
    content: (
      <div>
        <b>+ ក្លេរ៉ូទិច</b>​ <br />
        <div className="ml-4">
          • ជាស្រទាប់ក្រៅបង្អស់ វាមានពណ៌ស ក្រាស់ រឹង ហើយស្វិត<br />
          • វាមាននាទីផ្ដល់រូបរាងឲ្យគ្រាប់ភ្នែក និងការពារផ្នែកខាងក្នុងរបស់គ្រាប់ភ្នែក<br />
          • នៅផ្នែកខាងមុខនៃភ្នែកភ្នាសក្លេរ៉ូទិច ឡើងថ្លាហើយប៉ោងជាករនេ។ កនេមានរាងកោងជាងទម្រង់ភ្នែកទាំងមូល។ <br />
          • លក្ខណៈកោងនៃករនេជួយពត់ពន្លឺកាំរស្មីដែលចាំងចូលមកក្នុងភ្នែកឲ្យរួមជួបជាមួយគ្នា នៅត្រង់កន្លែងតែមួយលើភ្នាសរេទីន។<br />
        </div><br />

        <b>+ កូរ៉ូអុីត </b><br />
        <div className="ml-4">
          • ជាស្រទាប់កណ្ដាលស្ដើងពណ៌ត្នោតចាស់និងសុម្បូរសរសៃឈាម។ វាមាននាទី ស្រូបយកកាំរស្មីនៃពន្លឺ បង្ការពន្លឺជះត្រឡប់មកវិញ 
          ដឹកនាំសារធាតុចិញ្ចឹម និងអុកស៊ីសែនទៅផ្គត់ផ្គង់ឲ្យស្រទាប់រេទីន នឹងរក្សាលំនឹងសីតុណ្ហភាពនៅក្នុងភ្នែក។<br />
          • ផ្នែកខាងមុខនៃភ្នែកស្រទាប់កូរ៉ូអុីតឡើងក្រាស់ហើយមានរាងជារង្វង់មូលគឺ <b>អង់ស៊ីលីយែ</b>។ ចេញពីអង្គស៊ីលីយែ ស្រទាប់នេះឡើងស្ដើងហើយមានរាងមូលគឺប្រស្រីភ្នែក។<br />
          • <b>អង់ស៊ីលីយែ</b> ជាសាច់ដុំរលីងដែលស្ថិតនៅជុំវិញកែវភ្នែកវាត្រួតពិនិត្យរូបរាងទំហំកែវភ្នែកសម្រាប់គំហើញជិតនិងគំហើញឆ្ងាយ។<br />
          • ប្រស្រីភ្នែកកើតឡើងពីសាច់ដុំរលីងដែលមានផ្ទុកជាតិពណ៌។ ជាតិពណ៌នៃស្រទាប់កូរ៉ូអុីតនេះផ្ដល់ពណ៌ដល់ប្រស្រីភ្នែករបស់មនុស្សម្នាក់ៗដូចជា 
          មនុស្សខ្លះមានប្រស្រីភ្នែកពណ៌ប្រផេះ ពណ៌ត្នោត ខៀវជាដើម។<br />
          • រន្ធចំហមួយនៅចំកណ្ដាលប្រស្រីភ្នែកគឺ <b>រន្ធប្រស្រីភ្នែក</b>។ វាមាននាទីសម្រាប់ឲ្យពន្លឺចាំងចូល។<br />
          • ប្រស្រីភ្នែកតម្រូវទំហំរន្ធប្រស្រី ដើម្បីតម្រូវបរិមាណពន្លឺដែលចាំងចូល<br />
          • នៅពេលពន្លឺស្រទន់រន្ធប្រស្រីរីកធំដែលអាចឲ្យពន្លឺចាំងចូលកែវភ្នែកបានច្រើន។<br />
          • នៅពេលពន្លឺថ្ងៃភ្លឺខ្លាំងរន្ធប្រស្រីភ្នែករួមតូចដែលអាចឲ្យពន្លឺចាំងចូលក្នុងភ្នែកបានតិចតួច។<br />
        </div><br />

        <b>+ រ៉េទីន </b><br />
        <div className="ml-4">
          • ជាស្រទាប់ក្នុងបង្អស់ របស់គ្រាប់ភ្នែកដែល​មានកោសិការួសទៅនឹងពន្លឺពីរបែបគឺ កោសិកាកោន និងកោសិកាដំបង។
          ផូវាឬស្នាមលឿង ជាផ្នែកដែលរួសទៅនឹងពន្លឺជាងគេ។ វាបង្កើតឲមានគំហើញពណ៍។<br />
          • ចំណុចខ្វាក់​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ជាកន្លែងដែលសរសៃឈាមនិងសរសៃប្រសាទភ្ជាប់នឹងគ្រាប់ភ្នែក។​ ចំណុចខ្វាក់គ្មានធ្មួលពន្លឺទេ។<br />
        </div>
      </div>
    ),
  },
  {
    type: "tip",
    title: "មជ្ឈដ្ឋានថ្លា",
    content: (
      <div>
        កែវភ្នែកកើតឡើងពីសារធាតុទន់អន្ធិល។ កែវភ្នែកមនុស្សមានផ្នែកកណ្ដាលក្រាស់និងគែមជុំវិញស្ដើង<br />
        + ឃ្លប់គ្រាប់ភ្នែកមនុស្សមាន 3 ផ្នែកគឺ 
        <div className="ml-4">
          • <b>ផ្នែកទី 1 </b>ចន្លោះរវាងករនេ និងប្រស្រីភ្នែក<br />
          • <b>ផ្នែកទី 2 </b>រវាងប្រស្រីភ្នែក និងកែវភ្នែក។ផ្នែកទាំងពីរនេះមានសារធាតុរាវថ្លាគឺអ៊ុយម័រទឹក។ អ៊ុម័រទឹកមាននាទី រក្សាលំនឹងក្នុងឃ្លប់គ្រាប់ភ្នែក<br />
          • <b>ផ្នែកទី 3 </b>លំហនៅខាងក្រោយកែវភ្នែកដែលមានសារធាតុរាវអន្ធិលគឺ អ៊ុយម័រខន់។ អ៊ុយម័រខន់មាននាទីផ្ដល់នៅទម្រង់មាំដល់គ្រាប់ភ្នែកនិងបង្ការភ្នែកពីសម្ពាធខាងក្រៅ។
        </div>
      </div>
    ),
  },
  {
    type: "tip",
    title: "សរីរាង្គឧបសម្ព័ន្ធ",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/VisualSensory/VisualSensory2.png"
        imageAlt=""
        explanation={[
          <div>
            <b>ក. សរីរាង្គការពារភ្នែកមាន</b><br />
              • <b>ចិញ្ចើម:</b> ការពារកុំឲញើសហូរចូលក្នុងភ្នែក<br />
              • <b>ក្រឡង់ភ្នែក:</b> ភ្នែកព័ទ្ធជុំវិញដោយឆ្អឹងប្រឡង់ភ្នែក សម្រាប់ការពារភ្នែកទល់នឹងការប៉ះទង្គិចពីខាងក្រៅ<br />
              • <b>ត្របកភ្នែក:</b> មានរោមភ្នែកបង្កើតជាសំណាញ់ដែលការពារភ្នែកពីធូលីហុយចូល<br />
              • <b>ក្រពេញទឹកភ្នែក:</b> ស្ថិតនៅខាងក្រោយត្របកភ្នែកលើ មាននាទីបញ្ចេញទឹកភ្នែក ធ្វើឲប្រឡង់ភ្នែកមានភាពសើមជានិច្ច<br />
              • <b>ទឹកភ្នែក:</b> បង្កឡើងពីទឹកអំបិល លីសូសូម និងសមាសធាតុសរីរាង្គផ្សេងៗដែលផលិតចេញពីភ្នាសស្លេស្ម <br /><br />

              <b>ខ. សរីរាង្គចលករ</b><br />
              បំណិនបង្វិលគ្រាប់ភ្នែកសត្វឆ្អឹងកង បានដោយសារសាច់ដុំប្រាំមួយ សាច់ដុំនីមួយៗទទួលបានខុសត្រូវចំពោះចលនានៅក្នុង
              ទិសដៅពិសេសមួយ ដើម្បីមើលរូបភាពមួយមានវិមាត្របី ដែលតម្រូវដោយសរសៃប្រសាទលលាដ៍ក្បាល។
          </div>, 
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "កោសិការួសនិងពន្លឺ",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/VisualSensory/VisualSensory3.png"
        imageAlt=""
        explanation={[
          <div>
            កោសិការួសទៅនឹងពន្លឺគឺជាកោសិកាកោននិងកោសិកាដំបង។ កោសិកាទាំងពីរនេះស្ថិតនៅក្នុងស្រទាប់រេទីនមាន 
            <div className="ml-2">
              • <b>ស្រទាប់កោសិកាជាតិពណ៌:</b> ផ្សំជាមួយប្រូតេអុីនបង្កើតបានជាម៉ូលេគុលរ៉ូដុបស៊ីន។<br />
              • <b>កោសិកាកោន:</b> រស់ទៅនឹងពន្លឺខ្លាំង ដែលអាចឲ្យវាញែកនូវពណ៌ផ្សេងៗបាន និងរ៉ាប់រងនូវគំហើញលំអិតបាន។<br />
              • <b>កោសិកាដំបង:</b> រួសទៅនឹងពន្លឺខ្សោយដែលអាចឱ្យយើងមើលឃើញ ស ខ្មៅ។<br />
              • <b>កោសិកាទ្វេប៉ូល:</b> ភ្ជាប់និងបញ្ជូនអាំងភ្លុចប្រសាទពីកោសិកាកោន និងកោសិកាដំបងទៅកោសិកាកង់គ្លីយ៉ុង។<br />
              • <b>កោសិកាកង់គ្លីយ៉ុងឬកោសិកាពហុប៉ូល:</b> តភ្ជាប់ពីណឺរ៉ូនទ្វេប៉ូល ឬកោសិកាទ្វេប៉ូល ដោយបញ្ជូនអាំងភ្លុចប្រសាទតាមសរសៃប្រសាទអុបទិចទៅកាន់ខួរក្បាល។<br />
            </div>
            នៅពេលពន្លឺប៉ះហ្នឹងកោសិកាកោនឬកោសិកាដំបងវាបំបែកសម្ព័ន្ធគីមីរវាងជាតិពណ៌នៃស្រទាប់រេទីន និងប្រូតេអុីន បង្កើតឲ្យមាន 
            អាំងភ្លុចប្រាសាទដឹកនាំទៅកាន់ខួរក្បាល តាមសរសៃប្រសាទអុបទិចហើយខួរក្បាលធ្វើការបកស្រាយជាគំហើញ។
            សរសៃប្រសាទអុបទិចកើតពីសរសៃប្រសាទចេញពីកោសិកាកោនឬកោសិកាដំបងរួមគ្នា។
            មនុស្សខ្វាក់មាន់បណ្ដាលមកពីខ្វះវីតាមីនអាដែលមិនអាចមើលឃើញក្នុងពន្លឺខ្សោយទេ។
          </div>, 
        ]}
      />
    ),
  },
  {
    type: "tip",
    title: "គំហើញ",
    content: (
      <ImageExplanationBox
        title=""
        src="/docs/grade-12/biology/VisualSensory/VisualSensory4.png"
        imageAlt=""
        explanation={[
          <div>
            <b>ក. នាទីរបស់កែវភ្នែក</b><br />
              • កែវភ្នែកមាននាទីធ្វើឲ្យកាំរស្មីពន្លឺងាកនិងប្រសព្វចូលគ្នា។<br />
              • នៅពេលយើងក្រឡេកមើលវត្ថុអ្វីមួយកែវភ្នែកបង្កើតរូបភាពរបស់វត្ថុនោះលើស្រទាប់រេទីន នៅផ្នែកខាងក្រោយភ្នែក។រូបភាពនោះ
              មានលក្ខណៈក្រឡាប់ចុះក្រោម បន្ទាប់មកខួរក្បាលត្រឡប់រូបនោះមកសភាពដើមវិញហើយភ្នែករបស់យើងមើលឃើញវត្ថុនោះស្ថិតក្នុងសភាពធម្មតា។<br /><br />

              <b>ខ. ការសម្របតម្រូវ</b><br />
              • ដើម្បីមើលវត្ថុនៅជិតឲ្យបានច្បាស់កែវភ្នែកឡើងក្រាស់ ហើយដើម្បីមើលវត្ថុនៅឆ្ងាយឲ្យបានច្បាស់កែវភ្នែកឡើងស្ដើង។<br />
              • នៅពេលយើងមើលវត្ថុជិត អង្គស៊ីលីយែកន្ត្រាក់រួមតូច សរសៃចំណងប្រែជារលុងហើយធ្វើឲ្យកែវភ្នែកឡើងក្រាស់។<br />
              • ប្រសិនបើយើងមើលវត្ថុឆ្ងាយអង្គសុីលីយែបន្ធូរសរសៃចំណងឡើងតឹង ហើយទាញកែវភ្នែកឡើងស្ដើង។
          </div>, 
        ]}
      />
    ),
  },
  {
    type: "example",
    question: (
      <div>
        ភាពមិនប្រក្រតីនៃគំហើញរបស់ភ្នែកមនុស្សមាន: <br />
        <b>+ ភ្នែកអុីពែមេត្រូបនិងប្រេស្បីត:</b> មើលវត្ថុនៅជិតមិនច្បាស់ មើលវត្ថុឆ្ងាយច្បាស់។<br />
        <div className="ml-4">
          • ចម្ងាយអប្បបរមានៃគំហើញច្បាស់ឆ្ងាយជាងភ្នែកធម្មតា។<br />
          • ចំពោះវត្ថុនៅជិតរូបភាពកើតឡើងនៅខាងក្រោយរេទីនព្រោះប្រព័ន្ធអុបទិចបង្រួមតិច<br />
          • តម្រូវឲ្យពាក់វែនតាអង់ទីបង្រួម។<br /><br />
        </div>
        <b>+ ភ្នែកម្ញូប:</b> មើលវត្ថុនៅឆ្ងាយមិនច្បាស់។<br />
        <div className="ml-4">
          • ចម្ងាយអប្បបរមានៃកំហើញច្បាស់ខ្លីជាងភ្នែកធម្មតា។<br />
          • ចំពោះវត្ថុនៅឆ្ងាយរូបភាពកើតឡើងនៅខាងមុខរេទីនគឺប្រព័ន្ធអុបទិចបង្រួមខ្លាំងពេក។<br />
          • តម្រូវឲ្យពាក់វែនតាឡង់ទីពង្រីក។<br />
        </div><br />
        <b>+ ភ្នែកអាស្ទីម៉ាត</b><br />
        <div className="ml-4 ">
          • កំណោងគ្រាប់ភ្នែកមិនស្មើគ្នារូបភាពតែមួយមើលឃើញច្បាស់ខ្លះមិនច្បាស់ខ្លះ។<br />
          • តម្រូវឲ្យពាក់វ៉ែនតាឡង់ទីចិតជាស៊ីឡាំ<br />
        </div>
      </div>
    ),
  },
];

export default function VisualSensory() {
  return <ContentRendererV3 content={items} />;
}