import TopicPracticeBox from "../../../common/box/TopicPracticeBox";

import { PracticeExercise } from "@/types/docs/topic";


const ProteinQA = () => {

  const practiceExercises: PracticeExercise[] = [
    {
      id: "ex1",
      title: "",
      description: "សំណួរទី ១",
      problemType: "First Exercise",
      problems: [
        <p key="p1">ដូចម្តេចដែលហៅថាប្រូតេអ៊ីនងាយ? ប្រូតេអ៊ីនសាំញ៉ាំ? ចូរឲ្យឧទាហរណ៍បញ្ជាក់ចំនួនពីរ។</p>,
        <p key="p2">ដូចម្តេចដែលហៅថាអង់ដូស៊ីតូស? អិចសូស៊ីតូស?</p>
      ],
      answers: [
        <ul key="ul1" className="list-disc pl-5 flex flex-col gap-3 items-start">
          <li>ប្រូតេអ៊ីនងាយ ជាប្រូតេអ៊ីនដែលផ្សំឡើងពីអាស៊ីតអាមីនេសុទ្ធ ។</li>
          <p>_ ឧទាហរណ៍: សេរ៉ូមអាល់ប៊ុយមីន កេរ៉ាទីន។</p>
          <li>ប្រូតេអ៊ីនសាំញ៉ាំ ជាប្រូតេអ៊ីអ៊ុនដែលផ្សំឡើងពីអាស៊ីតអាមីនេ និងសមាសធាតុដទៃទៀតដែលមិនមែនជាអាស៊ីតអាមីនេ។ </li>
          <p>_ ឧទាហរណ៍: លីប៉ូប្រូតេអ៊ីន គ្លីកូប្រូតេអ៊ីន។</p>
        </ul>,
        <ul key="ul2" className="list-disc pl-5 flex flex-col gap-3 items-start">
          <li>អង់ដូស៊ីតូស ជាការដឹកនាំសារធាតុចូលទៅក្នុងកោសិកាដោយថង់ស៊ីតូប្លាស។</li>
          <li>អិចសូស៊ីតូសជាការដឹកនាំសារធាតុចេញពីកោសិកាដោយថង់ស៊ីតូប្លាស។</li>
        </ul>
      ]
    },
    {
      id: "ex2",
      title: "",
      description: "សំណួរទី ២",
      problemType: "Second Exercise",
      problems: [
        <p key="p3">តើប្រូតេអ៊ីនមានសារសំខាន់អ្វីខ្លះចំពោះសារពាង្គកាយ? តើប្រូតេអ៊ីនមាននាទីអ្វីខ្លះ ក្នុងដំណើរការប្រព្រឹត្តទៅរបស់សារពាង្គកាយ?</p>
      ],
      answers: [
        <div key="div1" className="flex flex-col gap-3 text-[15px]">
          <p>ប្រូតេអ៊ីនមានសារះសំខាន់ចំពោះសារពាង្គកាយគឺ ប្រូតេអ៊ីនជាសមាសធាតុគ្រឹះនៃជីវិត ដែលបង្កើតនូវរាល់សមាស
            ភាពរបស់សារពាង្គកាយ និងជាសម្ភារៈទ្រទ្រង់រាងកាយរបស់ភាវៈរស់។ ក្នុងដំណើរប្រព្រឹត្តទៅរបស់សារពាង្គកាយប្រូតេអ៊ីន
            មាននាទីជាអង់ស៊ីម ជាអរម៉ូន ជាអ្នកធ្វើចលនា ជាអ្នកការពារ ជាអ្នកដឹកនាំ និងជាប្រូតេអ៊ីនទម្រង់។</p>
        </div>
      ]
    },
    {
      id: "ex3",
      title: "",
      description: "សំណួរទី ៣",
      problemType: "Third Exercise",
      problems: [
        <p key="p4">ដូចម្តេចដែលហៅថា ក្រុមប្រូស្ដេទិច? ចូររកឧទាហរណ៍ក្រុមប្រូស្ដេទិចឲ្យបានបី?</p>
      ],
      answers: [
        <div key="div2" className="flex flex-col items-start text-[14px] gap-2">
          <p>ក្រុមប្រូស្ដេទិច ជាផ្នែកមួយនៃម៉ូលេគុលប្រូតេអ៊ីនសាំញ៉ាំ (អេតេរ៉ូប្រូតេអ៊ីន) ដែលមិនមែនជាអាស៊ីតអាមីនេ ហើយ
            មានតួនាទីសំខាន់ក្នុងសកម្មភាពប្រូតេអ៊ីន។ ឧទាហរណ៍:</p>
          <p>_ លីប៉ូប្រូតេអ៊ីនផ្ទុកលីពីត</p>
          <p>_ គ្លីកូប្រូតេអ៊ីនផ្ទុកកាបូនអ៊ីដ្រាត</p>
          <p>_ ផូស្វ័រប្រូតេអ៊ីនផ្ទុកផូស្វាត</p>
        </div>
      ]
    },
    {
      id: "ex4",
      title: "",
      description: "សំណួរទី ៤",
      problemType: "Fourth Exercise",
      problems: [
        <p key="p5">តើប្រូតេអ៊ីនសរសៃ មានលក្ខណះនិងនាទីដូចម្តេចខ្លះ? ចូរឲ្យឧទាហរណ៍បញ្ជាក់។</p>
      ],
      answers: [
        <div key="div3" className="flex flex-col gap-3 text-[15px]">
          <p>_ ប្រូតេអ៊ីនសរសៃមានលក្ខណះជាម៉ូលេគុលវែងៗ ហើយស្វិត និងមិនរលាយក្នុងទឹក។</p>
          <p>_ ប្រូតេអ៊ីនសរសៃមាននាទីជាអ្នកធ្វើចលនា ជាអ្នកការពារ និងជាប្រូតេអ៊ីនទម្រង់។</p>
          <p>ឧទាហរណ៍: ប្រូតេអ៊ីនដែលមាននៅក្នុងស្បែក ក្រចក សក់...។</p>
        </div>
      ]
    },
    {
      id: "ex5",
      title: "",
      description: "សំណួរទី ៥",
      problemType: "Fifth Exercise",
      problems: [
        <p key="p6">ហេតុអ្វីបានជាសាប៊ូអាចធ្វើឲ្យច្រវាក់ប៉ូលីប៉ិបទីតរលា?</p>
      ],
      answers: [
        <div key="div4" className="flex flex-col gap-3 text-[15px]">
          <p>បានជាសាប៊ូអាចធ្វើឲ្យច្រវាក់ប៉ូលីប៉ិបទីតរលា ព្រោះម៉ូលេគុលសាប៊ូអាចបង្អាក់ភាពបត់បែនរបស់ប្រូតេអ៊ីន ជាហេតុធ្វើឲ្យច្រវាក់ប៉ូលីប៉ិបទីតរលា។</p>
        </div>
      ]
    },
    {
      id: "ex6",
      title: "",
      description: "សំណួរទី ៦",
      problemType: "Sixth Exercise",
      problems: [
        <p key="p7">ហេតុអ្វីបានជាគេថាប្រូតេអ៊ីនជាអ្នកធ្វើចលនា?</p>
      ],
      answers: [
        <div key="div5" className="flex flex-col gap-3 text-[15px]">
          <p>បានជាគេថាប្រូតេអ៊ីនជាអ្នកធ្វើចលនា ពីព្រោះប្រូតេអ៊ីនអាក់ទីន(ភីឡាម៉ង់ឆ្នាៗ) ទុយប៊ុយលីន(កូនបំពង់តូចៗ)
            និងប្រូតេអ៊ីនផ្សេងៗទៀតក្នុងស៊ីតូប្លាសនៃកោសិកា សម្រាប់បង្កើតជាគ្រោងកោសិកា ធ្វើសកម្មភាព ចំណែកកោសិកា អង់ដូ
            ស៊ីតូស អិចសូស៊ីតូស និងចលនារបស់គោលិកាសផងដែរ។</p>
        </div>
      ]
    },
    {
      id: "ex7",
      title: "",
      description: "សំណួរទី ៧",
      problemType: "Seventh Exercise",
      problems: [
        <p key="p8">ចូរប្រៀបធៀបប្រូតេអ៊ីនសរសៃ និងប្រូតេអ៊ីនគ្រាប់។</p>
      ],
      answers: [
        <ul key="ul3" className="flex flex-col gap-3 text-[15px] list-disc pl-5">
          <li>លក្ខណះដូចគ្នា</li>
          <p>_ បង្កឡើងពីអាស៊ីតអាមីនេ</p>
          <p>_ ជាច្រវាក់ប៉ូលីប៉ិបទីត</p>
          <li>លក្ខណះខុសគ្នា</li>
          <p className="font-bold">ប្រូតេអ៊ុនសរសៃ</p>
          <p>_ ជាម៉ូលេគុលវែងៗហើយស្វិត។</p>
          <p>_ មិនរលាយក្នុងទឹក ។</p>
          <p>_ មាននាទីជាអ្នកធ្វើចលនា ជាអ្នកការពារ និងជាប្រូតេអ៊ីនទម្រង់។</p>
          <p className="font-bold">ប្រូតេអ៊ុនគ្រាប់</p>
          <p>_ ជាម៉ូលេគុលរាងមូលតូចៗ។</p>
          <p>_ រលាយក្នុងទឹក។</p>
          <p>_ មាននាទីជាអង់ស៊ីម ជាអ្នកដឹកនាំ និងជាអង់ទីករ។</p>
        </ul>
      ]
    },
  ];
  return (
    <div>
      <>
        <TopicPracticeBox exercises={practiceExercises} />
      </>
    </div>
  )
}

export default ProteinQA
