'use client'

import React from 'react'
import "katex/dist/katex.min.css";
import { InlineMath } from "react-katex";
import { TopicContent_V3 } from "@/types/docs/topic";
import ContentRendererV3 from "@/components/pages/docs/utils/ContentRendererV2";


const items: TopicContent_V3[] = [
  {
    type: "definition",
    title: "និយមន័យ",
    content: (
      <div>
        <p>​ <strong>អង់សុីម</strong>ជាម៉ូលេគុលប្រូតេអុីនដែលមាននាទីកាតាលីករជីវ ជួយជំរុញប្រតិកម្មគីមីជីវផ្សេងៗក្នុងសារពាង្គកាយ។​</p>
        <p>កាលណាកម្តៅកាន់តែក្តៅខ្លាំង ចលនានៃការប៉ះទង្គិចរបស់ម៉ូលេគុលកាន់តែកើនឡើង។</p>

      </div>

    ),
  },
    {
    type: "tip",
    title: "អ្វីទៅជាអង់សុីម?",
    content: (
      <div className='space-y-2'>
        <p>ក្នុងសារពាង្គកាយភាវះរស់សកម្មភាពផ្សេងៗនិងមិនអាចប្រព្រឺត្តទៅបានទេបើគ្មានអង់សុីមព្រោះក្នុងសារពាង្គកាយភាវះរស់
          មានប្រតិកម្មគីមីជីវត្រូវការកម្តៅឬកំហាប់អង្គធាតុប្រតិកម្មដើម្បីបង្កើនល្បឿនប្រតិកម្មគីមីទាំងនោះ។
        </p>
        <p>
          ក្នុងសារពាង្គកាយមានអង់សុីមេជាច្រើនប្រភេទព្រោះក្និងកោសិកាមានរាប់ពាន់ប្រតិកម្មគីមីខុសៗគ្នាហើយអង់សុីមមួយមានអំពើលើប្រតិកម្មគីមីតែមួយប្រភេទតែប៉ុណ្នោះ។
        </p>
      </div>
    ),
  },
  {
    type: 'hint',
    content: (
      <div>
        <p>
          ក្នុងសារពាង្គកាយមានអង់សុីមេជាច្រើនប្រភេទព្រោះក្នុងកោសិកាមានរាប់ពាន់ប្រតិកម្មគីមីខុសៗគ្នាហើយអង់សុីមមួយមានអំពើលើប្រតិកម្មគីមីតែមួយប្រភេទតែប៉ុណ្នោះ។
        </p>
      </div>
    ),
  },
  {
    type: "tip",
    title: "ក្នុងបន្ទប់ពិសោធន៍",
    content: (
      <div className='space-y-2'>
        <p>ដើម្បីបង្កើនល្បើនប្រតិកម្មគីមី គេប្រើកម្តៅ កំហាប់ប្រតិករនិង កាតាលីករអសរីរាង្គ។</p>
        <p>កាលណាកម្តៅកាន់តែក្តៅខ្លាំង ចលនានៃការប៉ះទង្គិចរបស់ម៉ូលេគុលកាន់តែកើនឡើង។</p>
      </div>

    ),
  },
  {
    type: "example",
    question: (
      <div>
        <InlineMath math={String.raw`{KClO}_{4} \rightarrow {KCl} + 2{O}_{2} `} />

      </div>
    ),
  },
  {
    type: "tip",
    title: "ចំណាំ",
    content: (
      <div>
        <p>ក្នុងសារពាង្គកាយ មានប្រតិកម្មគីមីជីវះជាច្រើន ដើម្បីបង្កើនល្បើនប្រតិកម្មគីមីជីវះទាំងនោះ ត្រូវការអង់សុីមទើបដំណើរការអាចប្រព្រឹត្តទៅបាន។</p>
      </div>

    ),
  },
  {
    type: "example",
    question: (
      <div className='space-y-2'>
        <p>- ក្នុងលំនាំរំលាយអាហារ បំបែកអាមីដុង លីពីត ប្រូតេអុីនអោយទៅជាសារធាតុចិញ្ចឹមងាយ ក្រោមអំពើអង់សុីម។</p>
        <p>- ក្នុងថ្លើមមានអង់សុីមកាតាឡាស ដែរមាននាទីបំបែកទឺកអុកសុីសែន (<InlineMath math={String.raw`H_2O_2`} />) អោយទៅជាទឹកនិងអុកសុីសែន។</p>
        <p>- អង់សុីម ជាកាតាលីករជីវះ ដែលជួយជំរុញល្បឿនប្រតិកម្មគីមីជីវះផ្សេងៗ។</p>
        <p>- អង់សុីមទាំងអស់េជាប្រូតេអុីន។</p>
      </div>
    ),
  },
];


const EnzymeDefinition = () => {
  return <ContentRendererV3 content={items} />;
}

export default EnzymeDefinition
